app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
	if  @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "sebastianzzz"], ["password_digest", "$2a$12$l9aeyw6.yFV2TY2BFRdl6.IB49X.YU76zQE0VI49fkXNQIwkVmP9."], ["updated_at", "2019-12-16 20:38:34.217781"], ["id", 5]]